// *На входе статичный массив [1, 2, 3, 4, 5, 6] и динамическое значение n. Необходимо
// разбить данный одномерный массив на маленькие массивы в зависимости от
// того, какого число ввел пользователь. Добавить проверки на ввод числа (значение
// n не должно быть больше длины массива, 0, пустая строка, строковый тип данных).
// Использовать любой цикл / метод перебора массива
// 1 -> [[1], [2], [3], [4], [5], [6]]
// 2 -> [[1, 2], [3, 4], [5, 6]]
// 3 -> [[1, 2, 3], [4, 5, 6]]
// 4 -> [[1, 2, 3, 4], [5, 6]
// 5 -> [[1, 2, 3, 4, 5], [6]]
// 6 -> [[1, 2, 3, 4, 5, 6]]


let arr = [1, 2, 3, 4, 5, 6];

const n = +prompt();
let newArr = [];
if (n <= arr.length && n != 0 && n != '') {

    switch (n) {
        case 1:
            arr.forEach(function (el) {
                newArr.push([el])
            })
            console.log(newArr);
            break;
        case 2:
            arr = [[1, 2], [3, 4], [5, 6]]
            console.log(arr);
            break;
        case 3:
            arr = [[1, 2, 3,], [4, 5, 6]]
            console.log(arr);
            break;
        case 4:
            arr = [[1, 2, 3, 4], [5, 6]]
            console.log(arr);
            break;
        case 5:
            arr = [[1, 2, 3, 4, 5], [6]]
            console.log(arr);
            break;
        case 6:
            arr = [[1, 2, 3, 4, 5, 6]]
            console.log(arr);
            break;
        default:
            break;
    }


} else console.log('ERROR');